from Bank.Bank import Bank
import json
import requests


class MTS(Bank):

    city_list = {
        "93395": {
            "name": "Амурск",
            "office": {
                "104209": {
                    "name": "ДО № 25 в пгт. Амурске",
                    "title": "Дополнительный офис №25",
                    "address": "682640, Амурск, Комсомольский пр-т, д. 4"
                }
            }
        },
        "93397": {
            "name": "Ангарск",
            "office": {
                "104255": {
                    "name": "ОО №2 в г. Ангарске",
                    "title": "Операционный офис № 2",
                    "address": "665825, Ангарск, 22 мкр-н, д. 13а"
                }
            }
        },
        "93399": {
            "name": "Армавир",
            "office": {
                "104269": {
                    "name": "ОО Армавирский",
                    "title": "Операционный офис «Армавирский»",
                    "address": "352900, Армавир, ул. Р. Люксембург, д. 158"
                }
            }
        },
        "93401": {
            "name": "Белогорск",
            "office": {
                "104211": {
                    "name": "ОО № 8 в г. Белогорске",
                    "title": "Операционный офис №8",
                    "address": "Амурская обл., г. Белогорск, ул. Кирова, 81."
                }
            }
        },
        "93403": {
            "name": "Бикин",
            "office": {
                "104213": {
                    "name": "ДО № 1 в г. Бикин",
                    "title": "Дополнительный офис №1",
                    "address": "682980, Хабаровский край, г. Бикин, пер. Безымянный, д. 2."
                }
            }
        },
        "93405": {
            "name": "Биробиджан",
            "office": {
                "104215": {
                    "name": "ОО № 3 в г. Биробиджане",
                    "title": "Операционный офис № 3",
                    "address": "679016, Биробиджан, Ленина ул., д. 44"
                }
            }
        },
        "93407": {
            "name": "Благовещенск",
            "office": {
                "104217": {
                    "name": "ОО № 20 в г. Благовещенске",
                    "title": "Операционный офис №20",
                    "address": "675000, Благовещенск, Зейская ул., д. 173а"
                }
            }
        },
        "93409": {
            "name": "Ванино",
            "office": {
                "104219": {
                    "name": "ДО № 6 в р.п. Ванино",
                    "title": "Дополнительный офис №6",
                    "address": "682860, Ванино п., Невского ул., д. 5"
                }
            }
        },
        "93411": {
            "name": "Владивосток",
            "office": {
                "104221": {
                    "name": "ОО № 21 в г. Владивостоке",
                    "title": "Операционный офис №21",
                    "address": "690033, Владивосток, 100-летия Владивостока пр-т, д. 57д"
                }
            }
        },
        "93413": {
            "name": "Волгоград",
            "office": {
                "104275": {
                    "name": "ОО Волгоградский",
                    "title": "Волгоградский операционный офис",
                    "address": "400131, Волгоград, Комсомольская ул., д. 10"
                }
            }
        },
        "93415": {
            "name": "Волжский",
            "office": {
                "104277": {
                    "name": "ОО Волжский",
                    "title": "Операционный офис «Волжский»",
                    "address": "404106, Волжский, Мира ул., д. 74А"
                }
            }
        },
        "93417": {
            "name": "Вяземск",
            "office": {
                "104223": {
                    "name": "ДО № 15 в г. Вяземский",
                    "title": "Дополнительный офис №15",
                    "address": "682950, г. Вяземский, ул. Коммунистическая, 11"
                }
            }
        },
        "93419": {
            "name": "Де-Кастри",
            "office": {
                "104225": {
                    "name": "ДО № 4 в с. Де-Кастри",
                    "title": "Дополнительный офис №4",
                    "address": "682429, Де-Кастри п., Краснофлотская ул, д. 2"
                }
            }
        },
        "93421": {
            "name": "Екатеринбург",
            "office": {
                "104297": {
                    "name": "ГОФ Екатеринбург",
                    "title": "Уральский филиал",
                    "address": "620075, Екатеринбург, пр-т Ленина д. 49/Тургенева ул. д.1"
                }
            }
        },
        "93423": {
            "name": "Иркутск",
            "office": {
                "104257": {
                    "name": "ОО Иркутский",
                    "title": "Иркутский операционный офис",
                    "address": "664025, Иркутск., Декабрьских Событий ул., д. 100"
                }
            }
        },
        "93425": {
            "name": "Казань",
            "office": {
                "104307": {
                    "name": "ОО Казанский",
                    "title": "Казанский операционный офис",
                    "address": "420097, Казань, Бутлерова ул. д. 35/15"
                }
            }
        },
        "93427": {
            "name": "Калининград",
            "office": {
                "104287": {
                    "name": "ОО Калининградский",
                    "title": "Калининградский операционный офис",
                    "address": "236000, Калининград, пр-т Мира, 74-76"
                }
            }
        },
        "93429": {
            "name": "Комсомольск-на-Амуре",
            "office": {
                "104227": {
                    "name": "ДО № 23 в г. Комсомольске-на-Амуре",
                    "title": "Дополнительный офис №23",
                    "address": "681018, Комсомольск-на-Амуре, Советская ул., д. 9"
                },
                "104229": {
                    "name": "ДО № 29 в г. Комсомольске-на-Амуре",
                    "title": "Дополнительный офис №29",
                    "address": "681024, Комсомольск-на-Амуре, Первостроителей пр-т, д. 19"
                }
            }
        },
        "93431": {
            "name": "Краснодар",
            "office": {
                "104271": {
                    "name": "ОО Комсомольский",
                    "title": "Операционный офис «Комсомольский»",
                    "address": "350080, Краснодар, Сормовская ул. д.177, кв.181"
                },
                "104279": {
                    "name": "ОО Краснодарский",
                    "title": "Краснодарский операционный офис",
                    "address": "350002, Краснодар, Северная ул. д. 353"
                }
            }
        },
        "93433": {
            "name": "Красноярск",
            "office": {
                "104259": {
                    "name": "ОО Красноярский",
                    "title": "Красноярский операционный офис",
                    "address": "660017, Красноярск, Горького ул., д. 37"
                }
            }
        },
        "93435": {
            "name": "Москва",
            "office": {
                "104183": {
                    "name": "Москва - ДО Отделение Крылатское",
                    "title": "Дополнительный офис «Отделение «Крылатское»",
                    "address": "121609, Москва, Осенний б-р д. 5, кор.1"
                },
                "104185": {
                    "name": "Москва - ДО На Марксистской",
                    "title": "Дополнительный офис «На Марксистской»",
                    "address": "109147, Москва, Воронцовская ул., д. 1/3, стр. 2"
                },
                "104187": {
                    "name": "Москва - ДО На Маяковской",
                    "title": "Дополнительный офис «На Маяковской»",
                    "address": "123001, Москва, Большая Садовая ул., д. 10"
                },
                "104189": {
                    "name": "Москва - ДО На Мясницкой",
                    "title": "Дополнительный офис «На Мясницкой»",
                    "address": "101000, Москва, Мясницкая ул., д. 11"
                },
                "104191": {
                    "name": "Москва - ДО Новый Арбат",
                    "title": "Дополнительный офис «Новый Арбат»",
                    "address": "121019, Москва, Новый Арбат ул. д. 2"
                },
                "104193": {
                    "name": "Москва - ДО Технопарк",
                    "title": "Дополнительный офис «Технопарк»",
                    "address": "115432, Москва, Андропова пр-т, д. 18, корп. 1"
                }
            }
        },
        "93437": {
            "name": "Находка"
        },
        "93439": {
            "name": "Нефтекамск",
            "office": {
                "104309": {
                    "name": "ДО г.Нефтекамск",
                    "title": "Дополнительный офис Уфимского филиала в г. Нефтекамск",
                    "address": "452683, Нефтекамск, Ленина ул., д. 46"
                }
            }
        },
        "93441": {
            "name": "Нижний Новгород",
            "office": {
                "104289": {
                    "name": "ОО Нижегородский",
                    "title": "Нижегородский операционный офис",
                    "address": "603006, Нижний Новгород, Провиантская ул. д. 47"
                }
            }
        },
        "93443": {
            "name": "Николаевске-на-Амуре",
            "office": {
                "104231": {
                    "name": "ДО № 7 в г. Николаевске-на-Амуре",
                    "title": "Дополнительный офис №7",
                    "address": "682460, Николаевск-на-Амуре, Ленина ул., д. 3"
                }
            }
        },
        "93445": {
            "name": "Новороссийск",
            "office": {
                "104281": {
                    "name": "ОО Новороссийск",
                    "title": "Операционный офис «Новороссийский»",
                    "address": "353900, г. Новороссийск, ул. Советов, д.7"
                }
            }
        },
        "93447": {
            "name": "Новосибирск",
            "office": {
                "104251": {
                    "name": "ГОФ Новосибирск",
                    "title": "Дополнительный офис На Станиславского",
                    "address": "630054, Новосибирск, Станиславского ул., д. 17"
                },
                "104253": {
                    "name": "Офис ОО и П Новосибирск",
                    "title": "Офис операционного обслуживания и продаж",
                    "address": "630004, г. Новосибирск, ул. Ленина, 52"
                }
            }
        },
        "93449": {
            "name": "Октябрьский",
            "office": {
                "104311": {
                    "name": "ДО в г.Октябрьский",
                    "title": "Дополнительный офис Уфимского филиала в г. Октябрьский",
                    "address": "452620, Октябрьский, Горького ул., д. 40"
                }
            }
        },
        "93451": {
            "name": "Омск",
            "office": {
                "104261": {
                    "name": "ОО Омский",
                    "title": "Омский операционный офис",
                    "address": "644024, Омск, Карла Маркса пр-т, д.15"
                }
            }
        },
        "93453": {
            "name": "Переяславка",
            "office": {
                "104233": {
                    "name": "ДО № 2 в р.п. Переяславка",
                    "title": "Дополнительный офис №2",
                    "address": "682910, Переяславка, Октябрьская ул., д. 50"
                }
            }
        },
        "93455": {
            "name": "Ростов-на-Дону",
            "office": {
                "104267": {
                    "name": "ГОФ Ростов-на-Дону",
                    "title": "Ростовский филиал",
                    "address": "344038, Ростов-на-Дону, Текучева, д. 137"
                }
            }
        },
        "93457": {
            "name": "Самара",
            "office": {
                "104313": {
                    "name": "ОО Самарский",
                    "title": "Самарский операционный офис",
                    "address": "443013, г. Самара, Московское шоссе, д. 4 строение 15"
                }
            }
        },
        "93459": {
            "name": "Санкт Петербург",
            "office": {
                "104283": {
                    "name": "ГОФ Санкт-Петербург",
                    "title": "Северо-Западный филиал",
                    "address": "197198, Санкт-Петербург, Добролюбова пр-т, д. 16А, корп. 2"
                },
                "104285": {
                    "name": "ДО Суворовский",
                    "title": "Дополнительный офис «Суворовский»",
                    "address": "193130, Санкт-Петербург, Суворовский пр., д. 19"
                }
            }
        },
        "93461": {
            "name": "Саратов",
            "office": {
                "104315": {
                    "name": "ОО Саратовский",
                    "title": "Саратовский операционный офис",
                    "address": "Саратов,ул. Московская 135/144"
                }
            }
        },
        "93463": {
            "name": "Советская Гавань",
            "office": {
                "104235": {
                    "name": "ДО № 20 в г. Советская Гавань",
                    "title": "Дополнительный офис №20",
                    "address": "682800, Советская Гавань, Советская ул., д. 28"
                }
            }
        },
        "93465": {
            "name": "Солнечный",
            "office": {
                "104237": {
                    "name": "ДО № 24 в пгт. Солнечный",
                    "title": "Дополнительный офис № 24",
                    "address": "682711, Солнечный, Ленина ул., д. 39"
                }
            }
        },
        "93467": {
            "name": "Соловьевск",
            "office": {
                "104239": {
                    "name": "ОО № 17 в п. Соловьевск",
                    "title": "Операционный офис № 17",
                    "address": "676271, Соловьёвск, Советская ул., д. 47"
                }
            }
        },
        "93469": {
            "name": "Сочи",
            "office": {
                "104273": {
                    "name": "ОО Сочинский",
                    "title": "Операционный офис «Сочинский»",
                    "address": "354000, Сочи, Воровского ул., д. 41"
                }
            }
        },
        "93473": {
            "name": "Стерлитамак",
            "office": {
                "104317": {
                    "name": "ДО в г. Стерлитамак",
                    "title": "Дополнительный офис Уфимского филиала в г. Стерлитамак",
                    "address": "453124, Стерлитамак, Мира ул. д.18"
                }
            }
        },
        "93475": {
            "name": "Сыктывкар",
            "office": {
                "104291": {
                    "name": "ОО Центральный Сыктывкар",
                    "title": "Операционный офис «Центральный»",
                    "address": "167000, Сыктывкар, Карла Маркса ул. д. 197, 1 этаж"
                },
                "104293": {
                    "name": "ОО Сыктывкарский",
                    "title": "Сыктывкарский операционный офис",
                    "address": "167000, Сыктывкар, Кирова ул. д. 45"
                }
            }
        },
        "93477": {
            "name": "Томск",
            "office": {
                "104263": {
                    "name": "ОО Томский",
                    "title": "Томский операционный офис",
                    "address": "634050, Томск, Совпартшкольный пер. д. 13"
                }
            }
        },
        "93479": {
            "name": "Туймазы",
            "office": {
                "104319": {
                    "name": "ДО в г.Туймазы",
                    "title": "Дополнительный офис Уфимского филиала в г. Туймазы",
                    "address": "452750, Туймазы, Комарова ул., д.22/1"
                }
            }
        },
        "93481": {
            "name": "Тында",
            "office": {
                "104241": {
                    "name": "ОО № 22 в г. Тынде",
                    "title": "Операционный офис №22",
                    "address": "676282, Тында, Амурская ул., д. 13"
                }
            }
        },
        "93483": {
            "name": "Тюмень",
            "office": {
                "104299": {
                    "name": "ОО Тюменский",
                    "title": "Тюменский Операционный офис",
                    "address": "Операционный офис Россия, г. Тюмень, ул. Мельникайте,100 А/1"
                }
            }
        },
        "93485": {
            "name": "Уссурийск",
            "office": {
                "104243": {
                    "name": "ОО № 13 в г. Уссурийске",
                    "title": "Операционный офис №13",
                    "address": "692519, Уссурийск, Плеханова ул., д. 75"
                }
            }
        },
        "93487": {
            "name": "Уфа",
            "office": {
                "104303": {
                    "name": "ГОФ Уфа",
                    "title": "Уфимский филиал",
                    "address": "450077, Уфа, Крупской ул., д. 8"
                },
                "104305": {
                    "name": "Офис ОО и П Уфа",
                    "title": "Дополнительный офис «Черниковка»",
                    "address": "450040, Уфа, Ульяновых ул., д. 31"
                },
                "104321": {
                    "name": "ДО Черниковка",
                    "title": "Дополнительный офис «Черниковка»",
                    "address": "450040, Уфа, Ульяновых ул., д. 31"
                }
            }
        },
        "93489": {
            "name": "Ухта",
            "office": {
                "104295": {
                    "name": "ОО Ухтинский",
                    "title": "Операционный офис «Ухтинский»",
                    "address": "169300, Ухта, Строителей пр. д. 10"
                }
            }
        },
        "93491": {
            "name": "Хабаровск",
            "office": {
                "104195": {
                    "name": "ГОФ Хабаровск",
                    "title": "Дополнительный офис «Центральный»",
                    "address": "680000, г. Хабаровск, ул. Дзержинского, 65 (здание Бизнес-центра «Феликс-СИТИ»)"
                },
                "104197": {
                    "name": "ДО № 3 в г. Хабаровске",
                    "title": "Дополнительный офис №3",
                    "address": "680054, Хабаровск, Профессора Даниловского М.П. ул., д. 6 «Б»"
                },
                "104199": {
                    "name": "ДО № 5 в г. Хабаровске",
                    "title": "Дополнительный офис №5",
                    "address": "680013, Хабаровск, Дикопольцева ул., д. 10, оф. 1"
                },
                "104201": {
                    "name": "ДО № 8 в г. Хабаровске",
                    "title": "Дальневосточный филиал, Дополнительный офис №8",
                    "address": "680021, Хабаровск, Ленинградская ул., д. 51"
                },
                "104203": {
                    "name": "ДО № 11 в г. Хабаровске",
                    "title": "Дополнительный офис №11",
                    "address": "680051, Хабаровск, Панфиловцев ул., д. 34, оф. 1"
                },
                "104205": {
                    "name": "ДО № 19 в г. Хабаровске",
                    "title": "Дополнительный офис №19",
                    "address": "680023, Хабаровск, Краснореченская ул., д. 169а"
                },
                "104207": {
                    "name": "ДО № 21 в г. Хабаровске",
                    "title": "Дополнительный офис №21",
                    "address": "680038 г. Хабаровск, ул. Серышева, 52."
                }
            }
        },
        "93493": {
            "name": "Хор",
            "office": {
                "104245": {
                    "name": "ДО № 17 в п. Хор",
                    "title": "Дополнительный офис №17",
                    "address": "682920, Хор, Ленина ул., д. 23"
                }
            }
        },
        "93495": {
            "name": "Челябинск",
            "office": {
                "104301": {
                    "name": "ОО Челябинский",
                    "title": "Челябинский операционный офис",
                    "address": "454091, Челябинск, Карла Маркса ул. д. 38"
                }
            }
        },
        "93497": {
            "name": "Чердомын",
            "office": {
                "104247": {
                    "name": "ДО № 9 в р.п. Чегдомын",
                    "title": "Дополнительный офис № 9",
                    "address": "682030, Чегдомын, Центральная ул., д. 38"
                }
            }
        },
        "93499": {
            "name": "Чита",
            "office": {
                "104265": {
                    "name": "ОО №4 в г. Чите",
                    "title": "Операционный офис № 4",
                    "address": "672012, Чита, Бутина ул., д. 107, пом. 1"
                }
            }
        },
        "93501": {
            "name": "Южно-Сахалинск",
            "office": {
                "104249": {
                    "name": "ОО № 2 в г. Южно-Сахалинске",
                    "title": "Операционный офис № 2",
                    "address": "693013, Южно-Сахалинск, Мира пр-т, д. 245"
                }
            }
        }
    }

    def __init__(self, rec):
        super().__init__(rec)

        try:
            ad = rec["AuthData"]

            if ad is not None:
                self.auth_data = json.loads(ad)
        except Exception as e:
            raise e

    def is_allow_uncorrect_address(self):
        return True

    def is_in_odp(self, inn):
        return False

    def is_in_odp_full(self, inn, phone):

        return False

    def get_work_region_list(self):

        return [{"ID": "876", "name": "Амурская область"},
                {"ID": "585", "name": "Волгоградская область"},
                {"ID": "877", "name": "Еврейская автономная область"},
                {"ID": "878", "name": "Забайкальский край"},
                {"ID": "879", "name": "Иркутская область"},
                {"ID": "590", "name": "Калининградская область"},
                {"ID": "596", "name": "Краснодарский край"},
                {"ID": "602", "name": "Красноярский край"},
                {"ID": "604", "name": "Москва"},
                {"ID": "613", "name": "Нижегородская область"},
                {"ID": "615", "name": "Новосибирская область"},
                {"ID": "617", "name": "Омская область"},
                {"ID": "880", "name": "Приморский край"},
                {"ID": "623", "name": "Республика Башкортостан"},
                {"ID": "628", "name": "Республика Коми"},
                {"ID": "631", "name": "Республика Татарстан"},
                {"ID": "633", "name": "Ростовская область"},
                {"ID": "637", "name": "Самарская область"},
                {"ID": "639", "name": "Санкт-Петербург"},
                {"ID": "641", "name": "Саратовская область"},
                {"ID": "882", "name": "Сахалинская область"},
                {"ID": "644", "name": "Свердловская область"},
                {"ID": "648", "name": "Ставропольский край"},
                {"ID": "651", "name": "Томская область"},
                {"ID": "653", "name": "Тюменская область"},
                {"ID": "883", "name": "Хабаровский край"},
                {"ID": "660", "name": "Челябинская область"}]

    def get_work_region_city_list(self, region):

        #data = {'648': [{'name': 'Ставрополь', 'ID': '650'}],
                # '585': [{'name': 'Волгоград', 'ID': '586'},
                #        {'name': 'Волжский', 'ID': '587'}],
                # '883': [{'name': 'Хабаровск', 'ID': '884'},
                #        {'name': 'Солнечный', 'ID': '1071'},
                #        {'name': 'Чегдомын', 'ID': '1076'},
                #        {'name': 'Бикин', 'ID': '1053'},
                #        {'name': 'Вяземский', 'ID': '1056'},
                #        {'name': 'Хор', 'ID': '1075'},
                #        {'name': 'Переяславка', 'ID': '1068'},
                #        {'name': 'СоветскаяГавань', 'ID': '1070'},
                #        {'name': 'Комсомольск-на-Амуре', 'ID': '894'},
                #        {'name': 'Амурск', 'ID': '1050'},
                #        {'name': 'Де-Кастри', 'ID': '1057'},
                #        {'name': 'Ванино', 'ID': '1055'},
                #        {'name': 'Николаевск-на-Амуре', 'ID': '1066'}],
                # '623': [{'name': 'Нефтекамск', 'ID': '624'},
                #        {'name': 'Уфа', 'ID': '627'},
                #        {'name': 'Октябрьский', 'ID': '858'},
                #        {'name': 'Стерлитамак', 'ID': '625'},
                #        {'name': 'Туймазы', 'ID': '626'}],
                # '604': [{'name': 'Москва', 'ID': '605'}],
                # '639': [{'name': 'Санкт-Петербург', 'ID': '640'}],
                # '879': [{'name': 'Иркутск', 'ID': '1060'},
                #        {'name': 'Ангарск', 'ID': '1051'}],
                # '631': [{'name': 'Казань', 'ID': '632'}],
                # '590': [{'name': 'Калининград', 'ID': '591'}],
                # '596': [{'name': 'Краснодар', 'ID': '599'},
                #        {'name': 'Армавир', 'ID': '597'},
                #        {'name': 'Новороссийск', 'ID': '600'},
                #        {'name': 'Сочи', 'ID': '601'}],
                # '602': [{'name': 'Красноярск', 'ID': '603'}],
                # '613': [{'name': 'НижнийНовгород', 'ID': '614'}],
                # '617': [{'name': 'Омск', 'ID': '618'}],
                # '628': [{'name': 'Ухта', 'ID': '630'},
                #        {'name': 'Сыктывкар', 'ID': '629'}],
                # '876': [{'name': 'Соловьевск', 'ID': '1072'},
                #        {'name': 'Благовещенск', 'ID': '1049'},
                #        {'name': 'Тында', 'ID': '1073'}],
                # '880': [{'name': 'Уссурийск', 'ID': '1074'},
                #        {'name': 'Владивосток', 'ID': '1046'}],
                # '882': [{'name': 'Южно-Сахалинск', 'ID': '1079'}],
                # '877': [{'name': 'Биробиджан', 'ID': '1054'}],
                # '878': [{'name': 'Чита', 'ID': '1077'}],
                # '615': [{'name': 'Новосибирск', 'ID': '616'}],
                # '633': [{'name': 'Ростов-на-Дону', 'ID': '634'}],
                # '637': [{'name': 'Самара', 'ID': '638'}],
                # '641': [{'name': 'Саратов', 'ID': '642'}],
                # '651': [{'name': 'Томск', 'ID': '652'}],
                # '653': [{'name': 'Тюмень', 'ID': '654'}],
                # '644': [{'name': 'Екатеринбург', 'ID': '645'}],
                # '660': [{'name': 'Челябинск', 'ID': '661'}]}

        res = []

        for city in MTS.city_list:
            res.append({"name": MTS.city_list[city]["name"], "ID": city})

        return res

    def get_work_region_city_office_list(self, region, city):

        res = []

        for branch in MTS.city_list[city]["office"]:
            data = MTS.city_list[city]["office"][branch]
            res.append({'ID': branch, "name": data["title"] + " (" + data["address"] + ")"})

        return res

    def _login(self):
        url = "https://{}.amocrm.ru/private/api/auth.php?type=json".format(self.auth_data["ACCOUNT"])
        data = {
            "USER_LOGIN": self.auth_data["LOGIN"],
            "USER_HASH": self.auth_data["HASH"]
        }

        r = requests.post(url, json=data)
        json.loads(r.text)

        self.auth_data["cookies"] = r.cookies.get_dict()
        self.save_auth_data(json.dumps(self.auth_data))

    def send_org(self, org, log):

        city = None
        office = None

        if org["Комментарий"] is None or org["Комментарий"].find("#ОфисБанка:") == -1:
            log.write("Нет информации об отделении банка")
            raise Exception("Нет информации об отделении банка")

        address = org["Комментарий"]
        start_pos = address.find("#ОфисБанка:")
        address = org["Комментарий"][start_pos + 1:]
        end_pos = address.find("#")

        address = address[:end_pos]

        fields = address.split(":")

        city = fields[2]
        office = fields[3]
        email = fields[4]

        comment = org["Комментарий"]
        start_pos = comment.find("#")
        end_pos = comment.find("#", start_pos + 1)
        comment = comment[:start_pos] + comment[end_pos + 1:]

        if city is None or office is None:
            raise Exception("Не удалось определить офис банка")

        if self.auth_data["cookies"] is None or self.auth_data["cookies"] == "":
            self._login()

        url = "https://{}.amocrm.ru/api/v2/companies".format(self.auth_data["ACCOUNT"])

        phones = org["Телефон"].split("|")

        org_type = "ООО"
        if len(org["ИНН"]) == 12:
            org_type = "ИП"

        data = {
            "add": [{
                "name": org["Название"],
                "custom_fields": [{
                    "id": "51213",
                    "values": [{"value": phones[0], "enum": "WORK"}]
                }, {
                    "id": "51215",
                    "values": [{"value": email, "enum": "WORK"}]
                }, {
                    "id": "54059",
                    "values": [{"value": org["ИНН"]}]
                }, {
                    "id": "63065",
                    "values": [{"value": org["Фамилия"] + ' ' + org["Имя"] + ' ' + org["Отчество"]}]
                }, {
                    "id": "63067",
                    "values": [{"value": org_type, "enum": org_type}]
                }, {
                    "id": "63123",
                    "values": [{"value": MTS.city_list[city]["name"],
                                "enum": MTS.city_list[city]["name"]}]
                }, {
                    "id": "63321",
                    "values": [{"value": comment}]
                }, {
                    "id": "63667",
                    "values": [{"value": "Новая", "enum": "Новая"}]
                }, {
                    "id": "70965",
                    "values": [{"value": MTS.city_list[city]["office"][office]["name"],
                                "enum": MTS.city_list[city]["office"][office]["name"]}]
                }]
            }
            ]
        }

        log.write(str(data) + "\n")
        log.flush()

        r = requests.post(url, json=data, cookies=self.auth_data["cookies"])

        if r.status_code == 401:
            self._login()
            r = requests.post(url, json=data, cookies=self.auth_data["cookies"])

        log.write(r.text + "\n")
        log.flush()

    def send_org_old(self, org, log):

        region = None
        city = None
        office = None

        if org["Комментарий"] is None or org["Комментарий"].find("#ОфисБанка:") == -1:
            log.write("Нет информации об отделении банка")
            raise Exception("Нет информации об отделении банка")

        address = org["Комментарий"]
        start_pos = address.find("#ОфисБанка:")
        address = org["Комментарий"][start_pos + 1:]
        end_pos = address.find("#")

        address = address[:end_pos]

        fields = address.split(":")

        region = fields[2]
        city = fields[3]
        office = fields[4]
        email = fields[5]

        comment = org["Комментарий"]
        start_pos = comment.find("#")
        end_pos = comment.find("#", start_pos + 1)
        comment = comment[:start_pos] + comment[end_pos + 1:]

        if region is None or city is None or office is None:
            raise Exception("Не удалось определить офис банка")

        org_type = "Общества с ограниченной ответственностью"
        if len(org["ИНН"]) == 12:
            org_type = "Индивидуальные предприниматели"

        text = """Мобильный телефон: {}\n"""\
               """Электронная почта: {}\n"""\
               """Регион: {}\n"""\
               """Населенный пункт: {}\n"""\
               """Филиал: {}\n"""\
               """Организационно прововая форма: {}\n"""\
               """ФИО: {}\n"""\
               """Название: {}\n"""\
               """ИНН: {}\n"""\
               """Комментарий: {}\n"""

        text = text.format(org["Телефон"], email, region, city, office, org_type,
                           org["Фамилия"] + ' ' + org["Имя"] + ' ' + org["Отчество"],
                           org["Название"], org["ИНН"], comment)

        url = "https://script.google.com/macros/s/AKfycbzcuzZkZ4cUmwsvKkgPOpm5p01UaSBd4nM-xaCYTaP35N8Qqmg/exec?subject={}&message={}".format("Профит сейл.Заявка {}".format(org["Номер"]), text)
        res = requests.post(url, json={"subject": "123111", "message": "231111"})

        i = 0

        #smtpObj = smtplib.SMTP('smtp.mail.yahoo.com', 587)
        #smtpObj.starttls()
        #smtpObj.login('litrez007@yahoo.com', 'hj7Gsv4lOe')

        #msg = MIMEText(text, _charset="UTF-8")
        #msg["Subject"] = Header("Профит сейл.Заявка {}".format(org["Номер"])).encode()

        #smtpObj.sendmail("litrez007@yahoo.com", ["koromandeu@mail.ru", "Rgusejnov@mtsbank.ru"], msg.as_string())
        #smtpObj.sendmail("litrez007@yahoo.com", ["koromandeu@mail.ru", "koroman100@mail.ru"], msg.as_string())
        #smtpObj.quit()

    def is_multithread_odp(self):
        return False

    def odp_delay(self):
        pass

if __name__ == "__main__":
    from DataBase.DBController import DBController

    controller = DBController()
    cur = controller.get_cursor()

    cur.execute("""SELECT * From Bank WHERE Name = %s;""", ("МТС",))

    bank_list = cur.fetchall()

    bank_rec = bank_list[0]

    bank = MTS(bank_rec)

    data_to_send = {
        "Имя": "Иван",
        "Отчество": "Иванович",
        "Фамилия": "Иванов",
        "Телефон": "+79056335029",
        "Название": "ИП КБ",
        "ИНН": "123123123123",
        "Адрес": "123",
        "Комментарий": "#ОфисБанка:МТС:Омская область:Омск:Омский операционный офис#",
        "Номер": "332"
    }

    bank.send_org(data_to_send, None)
